CarRentWebApp/CarRentWebApp/Service References/GetCarServiceReference/GetCarWSDL.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns="http://xml.netbeans.org/schema/CarRentalSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" name="GetCarWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <plnk:partnerLinkType name="">
    <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
    <plnk:role name="GetCarWSDLPortTypeRole" portType="tns:GetCarWSDLPortType" />
  </plnk:partnerLinkType>
  <wsdl:types>
    <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL">
      <xsd:import schemaLocation="http://192.168.1.77:9080/CarBinderCA-sun-http-binding/CarRentalBPEL/CarRentalSchema.xsd" namespace="http://xml.netbeans.org/schema/CarRentalSchema" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="GetCarWSDLOperationResponse">
    <wsdl:part name="car" type="ns:CarComplexType" />
  </wsdl:message>
  <wsdl:message name="GetCarWSDLOperationRequest">
    <wsdl:part name="carId" type="xsd:int" />
    <wsdl:part name="getCarProviderId" type="xsd:string" />
  </wsdl:message>
  <wsdl:portType name="GetCarWSDLPortType">
    <wsdl:operation name="GetCarWSDLOperation">
      <wsdl:input name="input1" message="tns:GetCarWSDLOperationRequest" />
      <wsdl:output name="output1" message="tns:GetCarWSDLOperationResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GetCarWSDLBinding" type="tns:GetCarWSDLPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="GetCarWSDLOperation">
      <soap:operation soapAction="" />
      <wsdl:input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL" />
      </wsdl:input>
      <wsdl:output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GetCarWSDLService">
    <wsdl:port name="GetCarWSDLPort" binding="tns:GetCarWSDLBinding">
      <soap:address location="http://192.168.1.77:9080/GetCarWSDLService/GetCarWSDLPort" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>