CarRentalCA/test/GetCarTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetCarWSDL">
  <soapenv:Body>
    <get:GetCarWSDLOperation>
      <getCarId>1</getCarId>
      <getCarProviderId>bech</getCarProviderId>
    </get:GetCarWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>